# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'findutils'
brew 'git'
brew 'git-lfs'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'moreutils'
brew 'openssh'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'the_silver_searcher'
brew 'tree' # List directories in a tree structure
brew 'vim'

# Non essential
brew 'fortune'
brew 'cowsay'
brew 'lolcat'

# Development
# brew 'docker'
# brew 'elasticsearch'
# brew 'go'
# brew 'heroku'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'python'
# brew 'redis'
# brew 'yarn'
brew 'zsh'

# Apps
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'cloudapp'
cask 'firefox-developer-edition'
cask 'gitkraken'
cask 'google-chrome'
cask 'grammarly'
cask 'hyperswitch'
cask 'iterm2'
cask 'karabiner-elements'
cask 'parallels'
cask 'paw'
cask 'slack'
cask 'spotify'
cask 'suspicious-package'
cask 'transmission'
cask 'transmit'
cask 'tuple'
cask 'typora'
cask 'vagrant'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Magnet', id: 441258766



# Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew install aircrack-ng
# brew install bfg
# brew install binutils
# brew install binwalk
# brew install cifer
# brew install dex2jar
# brew install dns2tcp
# brew install fcrackzip
# brew install foremost
# brew install hashpump
# brew install hydra
# brew install john
# brew install knock
# brew install netpbm
# brew install nmap
# brew install pngcheck
# brew install socat
# brew install sqlmap
# brew install tcpflow
# brew install tcpreplay
# brew install tcptrace
# brew install ucspi-tcp # `tcpserver` etc.
# brew install xpdf
# brew install xz
